Sample Service SQL/testcase/sqlAdapter/operation1/.$operation1.trace/request.log

POST /SchedulerService/SQLScheduler HTTP/1.0
X-Bridge: NoErrorReturn
Request-ID: operation1_1753932106235
SOAPAction: 
User-Agent: SOAPTestTool/1.0 (Java HotSpot(TM) 64-Bit Server VM/25.92-b14)
Host: localhost:51900
Content-Length: 858
Content-Type: text/xml; charset=utf-8

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
              xmlns:xsd="http://www.w3.org/2001/XMLSchema"
              xmlns:ns0="urn:Services.NameOfService1.SQLAdapter.SQLScheduler"
              xmlns:bridge="http://e2e.ch/bridge"
              xmlns:ns1="urn:Services.NameOfService1.Classes"
              xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
              env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
   <env:Header>
      <bridge:Trace level="None" maxSize="10"/>
   </env:Header>
   <env:Body>
      <ns0:operation1>
         <empClass xsi:type="ns1:employee">
            <fld_employeeid xsi:type="xsd:integer">2</fld_employeeid>
            <fld_name xsi:type="xsd:string">clark</fld_name>
            <fld_address xsi:type="xsd:string">turbina</fld_address>
            <fld_age xsi:type="xsd:integer">24</fld_age>
         </empClass>
      </ns0:operation1>
   </env:Body>
</env:Envelope>